solvers/chtMultiRegionInterFoam/tut/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;


xMin   -0.1; 
xMax    0.1;

yMin    -0.1;
yMax    0.2;

zMin     -0.01;
zMax     0.01;

vertices
(
    ($xMin $yMin  $zMin)
    ($xMax $yMin  $zMin)
    ($xMax $yMax  $zMin)
    ($xMin $yMax  $zMin)
    ($xMin $yMin  $zMax)
    ($xMax $yMin  $zMax)
    ($xMax $yMax  $zMax)
    ($xMin $yMax  $zMax)
);

blocks
(
    //hex (0 1 2 3 4 5 6 7) (20 30 1) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (200 300 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    maxY
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    minX
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    maxX
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    minY
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    minZ
    {
        type empty;//wall;
        faces
        (
            (0 3 2 1)
        );
    }
    maxZ
    {
        type empty;//wall;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
