solvers/chtMultiRegionInterFoam/tut/0.orig/water/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0/water";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    maxY
    {
        type            zeroGradient;
    }
    minX
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    maxX
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    minZ
    {
        type            empty;
    }
    maxZ
    {
        type            empty;
    }
    water_to_heater
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
