solvers/chtMultiRegionInterFoam/tut/0.orig/heater/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/heater";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    minX
    {
        type            calculated;
        value           uniform 100000;
    }
    maxX
    {
        type            calculated;
        value           uniform 100000;
    }
    minY
    {
        type            calculated;
        value           uniform 100000;
    }
    minZ
    {
        type            empty;
    }
    maxZ
    {
        type            empty;
    }
    heater_to_water
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
