solvers/chtMultiRegionInterFoam/tut/0.orig/water/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/water";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    maxY
    {
        type            calculated;
        value           uniform 0;
    }
    minX
    {
        type            calculated;
        value           uniform 0;
    }
    maxX
    {
        type            calculated;
        value           uniform 0;
    }
    minZ
    {
        type            empty;
        value           uniform 0;
    }
    maxZ
    {
        type            empty;
        value           uniform 0;
    }
    water_to_heater
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
