solvers/chtMultiRegionInterFoam/tut/0.orig/heater/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/heater";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    minX
    {
        type            zeroGradient;
        value           uniform 300;
    }
    maxX
    {
        type            zeroGradient;
        value           uniform 300;
    }
    minY
    {
        type            fixedValue;
        value           uniform 500;
    }
    minZ
    {
        type            empty;
        value           uniform 300;
    }
    maxZ
    {
        type            empty;
        value           uniform 300;
    }
    heater_to_water
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     solidThermo;
    }
}


// ************************************************************************* //
