solvers/chtMultiRegionInterFoam/tut/0.orig/water/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/water";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    maxY
    {
        type            fixedValue;
        value           uniform 300;
    }
    minX
    {
        type            zeroGradient;
        value           uniform 300;
    }
    maxX
    {
        type            zeroGradient;
        value           uniform 300;
    }
    minZ
    {
        type            empty;
        value           uniform 300;
    }
    maxZ
    {
        type            empty;
        value           uniform 300;
    }
    water_to_heater
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     lookup;
        kappa           kappa;
    }
}


// ************************************************************************* //
