solvers/chtMultiRegionInterFoam/tut/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Heater
    {
        name    heaterCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-1000 -1000 -1000) (1000 0.0 1000);
    }
    {
        name    heater;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     heaterCellSet;
    }
    // water is all the other cells
    {
        name   waterCellSet;
        type    cellSet;
        action  new;
        source  cellToCell;
        set     heaterCellSet;
    }
    {
        name    waterCellSet;
        type    cellSet;
        action  invert;
    }
    {
        name    water;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     waterCellSet;
    }
);


// ************************************************************************* //
