solvers/chtMultiRegionInterFoam/tut/system/water/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

U
{
    internalField   uniform (0.001 0 0);

    boundaryField
    {

        ".*"
        {
            type            fixedValue;
            value           uniform (0 0 0);
        }
        
        "(minZ|maxZ)"
        {
            type            empty;
        }   
        maxY
        {
            type            zeroGradient;
            value           uniform (0.0 0 0);
        }

    }
}

T
{
    internalField   uniform 300;

    boundaryField
    {

        ".*"
        {
            type            zeroGradient;
            value           uniform 300;
        }

        "(minZ|maxZ)"
        {
            type            empty;
        }

        "water_to_.*"
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     lookup;
            kappa		kappa;
            value           uniform 300;
        }
        maxY
        {
            type            fixedValue; //inletOutlet
            value           uniform 300;
        }
    }
}

epsilon
{
    internalField   uniform 0.01;

    boundaryField
    {
        
        ".*"
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }
        
        "(minZ|maxZ)"
        {
            type            empty;
        }
    }
}

k
{
    internalField   uniform 0.1;

    boundaryField
    {

        ".*"
        {
            type            kqRWallFunction;
            value           uniform 0.1;
        }
        "(minZ|maxZ)"
        {
            type            empty;
        }
    }
}

p_rgh
{
    internalField   uniform 0;

    boundaryField
    {
        
        ".*"
        {
            type            fixedFluxPressure;
            value           uniform 0;
        }
        "(minZ|maxZ)"
        {
            type            empty;
        }
        
        maxY
        {
            type            fixedValue; //totalPressure
            value	    uniform 0;
        }
    }
}

p
{
    internalField   uniform 0;

    boundaryField
    {
        ".*"
        {
            type            calculated;
            value           uniform 0;
        }
        "(minZ|maxZ)"
        {
            type            empty;
        }
    }
}


// ************************************************************************* //
