solvers/chtMultiRegionInterFoam/tut/system/water/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volVectorFieldValue U (0 0 0)
);

regions
(
    // Set cell values
    // (does zerogradient on boundaries)
    cylinderToCell
    {
        point1 (0 0.1 -1000);
        point2 (0 0.1  1000);
        radius 0.025;

        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }

);

// ************************************************************************* //
